---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctPressureDropData
source: html/53565301-b25a-cd38-0c68-bed19d619c25.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData

The input and output data used by external servers for calculation of the duct pressure drop.

## Syntax (C#)
```csharp
public class DuctPressureDropData : IDisposable
```

## Remarks
Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation